========================================================================
compute_cp
========================================================================
cross product: [ 0 -1.00000 ] 
scalar product: 0: 0
========================================================================

========================================================================
compute_cp
========================================================================
cross product: [ 0 0 1.00000 ] 
scalar product: 0: 0
scalar product: 1: 0
========================================================================

========================================================================
compute_cp2
========================================================================
cross product: [ 1.00000 0 ] 
scalar product: 0: 0
========================================================================

========================================================================
compute_cp2
========================================================================
cross product: [ -1.00000 2.00000 -1.00000 ] 
scalar product: 0: 0
scalar product: 1: 0
========================================================================

